zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_aux_sysif.h
/******************************************************************************
*  Filename:       hw_aux_sysif_h
*  Revised:        2018-05-14 12:24:52 +0200 (Mon, 14 May 2018)
*  Revision:       51990
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_AUX_SYSIF_H__
#define __HW_AUX_SYSIF_H__

//*****************************************************************************
//
// This section defines the register offsets of
// AUX_SYSIF component
//
//*****************************************************************************
// Operational Mode Request
#define AUX_SYSIF_O_OPMODEREQ                                       0x00000000

// Operational Mode Acknowledgement
#define AUX_SYSIF_O_OPMODEACK                                       0x00000004

// Programmable Wakeup 0 Configuration
#define AUX_SYSIF_O_PROGWU0CFG                                      0x00000008

// Programmable Wakeup 1 Configuration
#define AUX_SYSIF_O_PROGWU1CFG                                      0x0000000C

// Programmable Wakeup 2 Configuration
#define AUX_SYSIF_O_PROGWU2CFG                                      0x00000010

// Programmable Wakeup 3 Configuration
#define AUX_SYSIF_O_PROGWU3CFG                                      0x00000014

// Software Wakeup Triggers
#define AUX_SYSIF_O_SWWUTRIG                                        0x00000018

// Wakeup Flags
#define AUX_SYSIF_O_WUFLAGS                                         0x0000001C

// Wakeup Flags Clear
#define AUX_SYSIF_O_WUFLAGSCLR                                      0x00000020

// Wakeup Gate
#define AUX_SYSIF_O_WUGATE                                          0x00000024

// Vector Configuration 0
#define AUX_SYSIF_O_VECCFG0                                         0x00000028

// Vector Configuration 1
#define AUX_SYSIF_O_VECCFG1                                         0x0000002C

// Vector Configuration 2
#define AUX_SYSIF_O_VECCFG2                                         0x00000030

// Vector Configuration 3
#define AUX_SYSIF_O_VECCFG3                                         0x00000034

// Vector Configuration 4
#define AUX_SYSIF_O_VECCFG4                                         0x00000038

// Vector Configuration 5
#define AUX_SYSIF_O_VECCFG5                                         0x0000003C

// Vector Configuration 6
#define AUX_SYSIF_O_VECCFG6                                         0x00000040

// Vector Configuration 7
#define AUX_SYSIF_O_VECCFG7                                         0x00000044

// Event Synchronization Rate
#define AUX_SYSIF_O_EVSYNCRATE                                      0x00000048

// Peripheral Operational Rate
#define AUX_SYSIF_O_PEROPRATE                                       0x0000004C

// ADC Clock Control
#define AUX_SYSIF_O_ADCCLKCTL                                       0x00000050

// TDC Counter Clock Control
#define AUX_SYSIF_O_TDCCLKCTL                                       0x00000054

// TDC Reference Clock Control
#define AUX_SYSIF_O_TDCREFCLKCTL                                    0x00000058

// AUX_TIMER2 Clock Control
#define AUX_SYSIF_O_TIMER2CLKCTL                                    0x0000005C

// AUX_TIMER2 Clock Status
#define AUX_SYSIF_O_TIMER2CLKSTAT                                   0x00000060

// AUX_TIMER2 Clock Switch
#define AUX_SYSIF_O_TIMER2CLKSWITCH                                 0x00000064

// AUX_TIMER2 Debug Control
#define AUX_SYSIF_O_TIMER2DBGCTL                                    0x00000068

// Clock Shift Detection
#define AUX_SYSIF_O_CLKSHIFTDET                                     0x00000070

// VDDR Recharge Trigger
#define AUX_SYSIF_O_RECHARGETRIG                                    0x00000074

// VDDR Recharge Detection
#define AUX_SYSIF_O_RECHARGEDET                                     0x00000078

// Real Time Counter Sub Second Increment 0
#define AUX_SYSIF_O_RTCSUBSECINC0                                   0x0000007C

// Real Time Counter Sub Second Increment 1
#define AUX_SYSIF_O_RTCSUBSECINC1                                   0x00000080

// Real Time Counter Sub Second Increment Control
#define AUX_SYSIF_O_RTCSUBSECINCCTL                                 0x00000084

// Real Time Counter Second
#define AUX_SYSIF_O_RTCSEC                                          0x00000088

// Real Time Counter Sub-Second
#define AUX_SYSIF_O_RTCSUBSEC                                       0x0000008C

// AON_RTC Event Clear
#define AUX_SYSIF_O_RTCEVCLR                                        0x00000090

